### This script contains the following points:

#### 1. Import your analysis libraries, as well as your new customer data set as a dataframe
#### 2. Wrangle the data so that it follows consistent logic
#### 3. Complete the fundamental data quality and consistency checks
#### 4. Combine your customer data with the rest of your prepared Instacart data
#### 5. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task

# 1. Import your analysis libraries, as well as your new customer data set as a dataframe

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# Tell Python to remember a main folder path
path = r'C:\Users\Frederick\Documents\CareerFoundry\CF - Data Analytics Immersion\Achievement4\04-2024 Instacart Basket Analysis'

In [4]:
# Import new customer data set from the 'Original Data' folder as a dataframe
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
# Preview the newly imported dataframe 
customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [6]:
# Check the dimensions of the dataframe
customers.shape

(206209, 10)

In [7]:
# View descriptive statistics 
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# Check data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# 2. Wrangle the data so that it follows consistent logic

In [9]:
# Rename the columns to establish uniformity
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [10]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [11]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [12]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [13]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [14]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [15]:
# Check columns
customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

The columns have been successfully renamed and are now uniform and clear

In [16]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In terms of dropping columns, I think analysis for each of these columns is possible and effective

# 3. Complete the fundamental data quality and consistency checks

In [17]:
# Address data-types and potential mixed data-types in the dataframe
customers.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [18]:
# Checking for mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [19]:
# The output revealed that the 'first_name' column has mixed data-types that need to be addressed
customers['first_name'] = customers['first_name'].astype('str')

In [20]:
# The 'user_id' column, while not containing mixed data-types, is still improperly listed as an integer
customers['user_id'] = customers['user_id'].astype('str')

In [21]:
# Re-check the data-types in the data frame and for mixed data-types
customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [22]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

Now all columns are the appropriate data-types and no mixed data-types are present in any columns

In [23]:
# Check for missing data
customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [24]:
# Check for full-duplicates
customers_dups = customers[customers.duplicated()]

In [25]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [26]:
# Perform a descriptive statistic check to ensure everything looks normal
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

There's nothing unusual present in the descriptive statistics

# 4. Combine your customer data with the rest of your prepared Instacart data

In [27]:
# Import the rest of the prepared Instacart data
orders_products = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'aggregated_ords_prods_merge.pkl'))

In [28]:
# Check the shape of the newly imported dataframe
orders_products.shape

(32404859, 26)

In [29]:
# Check the shape of the customers dataframe
customers.shape

(206209, 10)

In [30]:
# Identify a shared column
orders_products.head(5)

,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,Customer_frequency,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,3139998,138,28,6,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent Customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1977647,138,30,6,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent Customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,11433,389851,709,2,0,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low_spender,8.0,Frequent Customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,12198,652770,764,1,3,...,Mid-range product,Regularly busy,Slowest days,Most orders,3,New customer,4.972414,Low_spender,9.0,Frequent Customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,12200,1813452,764,3,4,...,Mid-range product,Least busy,Slowest days,Average orders,3,New customer,4.972414,Low_spender,9.0,Frequent Customer

In [31]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [32]:
# Both dataframes share the 'user_id' column
# Check data-type of shared column
orders_products.dtypes['user_id']

dtype('int64')

In [33]:
customers.dtypes['user_id']

dtype('O')

In [34]:
# Make sure both key columns are the same data type
orders_products['user_id'] = orders_products['user_id'].astype('str')

In [35]:
orders_products.dtypes['user_id']

dtype('O')

The key columns now have matching data-types

In [36]:
# Here we take first 10000 rows
orders_products_subset = orders_products[:5000]
customers_subset = customers[:5000]

In [37]:
orders_products.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'Unnamed: 0', 'order_id', 'user_id', 'order_number',
       'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order',
       'first_order', 'add_to_cart_order', 'reordered', '_merge',
       'price_range_loc', 'busiest_day', 'busiest_days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'average_spend',
       'spender_flag', 'Customer_frequency', 'frequency_flag'],
      dtype='object')

In [38]:
custs_ords_prods = orders_products_subset.merge(customers_subset, on='user_id', indicator = False)

In [40]:
# Check shape of newly merged dataframe
custs_ords_prods.shape

(158, 35)

In [41]:
custs_ords_prods.head(5)

,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,...,frequency_flag,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,1,Chocolate Sandwich Cookies,61,19,5.8,186194,682486,11243,16,3,...,Frequent Customer,Robert,Herman,Male,Nevada,67,1/26/2017,3,married,58329
1,1,Chocolate Sandwich Cookies,61,19,5.8,206142,2616185,12455,2,6,...,Regular customer,Louise,Hogan,Female,Georgia,40,1/21/2017,2,married,34571
2,1,Chocolate Sandwich Cookies,61,19,5.8,535680,496407,32307,16,3,...,Regular customer,Victor,Rivers,Male,New Hampshire,18,1/28/2017,3,living with parents and siblings,27916
3,1,Chocolate Sandwich Cookies,61,19,5.8,649025,3038506,39081,16,2,...,Frequent Customer,Ruth,Sosa,Female,Indiana,60,1/16/2017,1,married,143885
4,1,Chocolate Sandwich Cookies,61,19,5.8,761351,1280621,45784,1,1,...,Frequent Customer,Jacqueline,Roach,Female,Mississippi,58,1/24/2017,1,married,48605

In [42]:
# Check inner join value counts
custs_ords_prods['_merge'].value_counts()

_merge
both          158
left_only       0
right_only      0
Name: count, dtype: int64

In [43]:
# Check data-types
custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Unnamed: 0                   int64
order_id                     int64
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
Customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
dtype: object

In [44]:
# The 'order_id' column also has the wrong data type, so let's fix it
custs_ords_prods['order_id'] = custs_ords_prods['order_id'].astype('str')

In [45]:
custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
Unnamed: 0                   int64
order_id                    object
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
add_to_cart_order            int64
reordered                    int64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
Customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
dtype: object

# 5.Export this new dataframe as a pickle file so you can continue to use it in the second part of this task

In [46]:
custs_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged.pkl'))